export const provincesAndDistricts = {
  "กรุงเทพมหานคร": [
    "เขตพระนคร", "เขตดุสิต", "เขตหนองจอก", "เขตบางรัก", "เขตบางเขน", "เขตบางกะปิ", "เขตปทุมวัน", "เขตป้อมปราบศัตรูพ่าย", "เขตพระโขนง", "เขตมีนบุรี", "เขตลาดกระบัง", "เขตยานนาวา", "เขตสัมพันธวงศ์", "เขตพญาไท", "เขตธนบุรี", "เขตบางกอกใหญ่", "เขตห้วยขวาง", "เขตคลองสาน", "เขตตลิ่งชัน", "เขตบางกอกน้อย", "เขตบางขุนเทียน", "เขตภาษีเจริญ", "เขตหนองแขม", "เขตราษฎร์บูรณะ", "เขตบางพลัด", "เขตดินแดง", "เขตบึงกุ่ม", "เขตสาทร", "เขตบางซื่อ", "เขตจตุจักร", "เขตบางคอแหลม", "เขตประเวศ", "เขตคลองเตย", "เขตสวนหลวง", "เขตจอมทอง", "เขตดอนเมือง", "เขตราชเทวี", "เขตลาดพร้าว", "เขตวัฒนา", "เขตบางแค", "เขตหลักสี่", "เขตสายไหม", "เขตคันนายาว", "เขตสะพานสูง", "เขตวังทองหลาง", "เขตคลองสามวา", "เขตบางนา", "เขตทวีวัฒนา", "เขตทุ่งครุ", "เขตบางบอน"
  ],
  "นนทบุรี": [
    "อำเภอเมืองนนทบุรี", "อำเภอบางกรวย", "อำเภอบางใหญ่", "อำเภอบางบัวทอง", "อำเภอไทรน้อย", "อำเภอปากเกร็ด"
  ],
  "สมุทรปราการ": [
    "อำเภอเมืองสมุทรปราการ", "อำเภอบางบ่อ", "อำเภอบางพลี", "อำเภอพระประแดง", "อำเภอพระสมุทรเจดีย์", "อำเภอบางเสาธง"
  ],
  "ปทุมธานี": [
    "อำเภอเมืองปทุมธานี", "อำเภอคลองหลวง", "อำเภอธัญบุรี", "อำเภอหนองเสือ", "อำเภอลาดหลุมแก้ว", "อำเภอลำลูกกา", "อำเภอสามโคก"
  ],
  "สมุทรสาคร": [
    "อำเภอเมืองสมุทรสาคร", "อำเภอกระทุ่มแบน", "อำเภอบ้านแพ้ว"
  ],
  "นครปฐม": [
    "อำเภอเมืองนครปฐม", "อำเภอกำแพงแสน", "อำเภอนครชัยศรี", "อำเภอดอนตูม", "อำเภอบางเลน", "อำเภอสามพราน", "อำเภอพุทธมณฑล"
  ],
  "ชลบุรี": [
    "อำเภอเมืองชลบุรี", "อำเภอบ้านบึง", "อำเภอหนองใหญ่", "อำเภอบางละมุง", "อำเภอพานทอง", "อำเภอพนัสนิคม", "อำเภอศรีราชา", "อำเภอเกาะสีชัง", "อำเภอสัตหีบ", "อำเภอบ่อทอง", "อำเภอเกาะจันทร์"
  ],
  "เชียงใหม่": [
    "อำเภอเมืองเชียงใหม่", "อำเภอจอมทอง", "อำเภอแม่แจ่ม", "อำเภอเชียงดาว", "อำเภอดอยสะเก็ด", "อำเภอแม่แตง", "อำเภอแม่ริม", "อำเภอสะเมิง", "อำเภอฝาง", "อำเภอแม่อาย", "อำเภอพร้าว", "อำเภอสันป่าตอง", "อำเภอสันกำแพง", "อำเภอสันทราย", "อำเภอหางดง", "อำเภอฮอด", "อำเภอดอยเต่า", "อำเภออมก๋อย", "อำเภอสารภี", "อำเภอเวียงแหง", "อำเภอไชยปราการ", "อำเภอแม่วาง", "อำเภอแม่ออน", "อำเภอดอยหล่อ", "อำเภอกัลยาณิวัฒนา"
  ],
  "ภูเก็ต": [
    "อำเภอเมืองภูเก็ต", "อำเภอกะทู้", "อำเภอถลาง"
  ]
};

export const transitData = {
  "BTS": {
    "สายสุขุมวิท (สีเขียวอ่อน)": ["คูคต", "แยก คปอ.", "พิพิธภัณฑ์กองทัพอากาศ", "โรงพยาบาลภูมิพลอดุลยเดช", "สะพานใหม่", "สายหยุด", "พหลโยธิน 59", "วัดพระศรีมหาธาตุ", "กรมทหารราบที่ 11", "บางบัว", "กรมป่าไม้", "มหาวิทยาลัยเกษตรศาสตร์", "เสนานิคม", "รัชโยธิน", "พหลโยธิน 24", "ห้าแยกลาดพร้าว", "หมอชิต", "สะพานควาย", "อารีย์", "สนามเป้า", "อนุสาวรีย์ชัยสมรภูมิ", "พญาไท", "ราชเทวี", "สยาม", "ชิดลม", "เพลินจิต", "นานา", "อโศก", "พร้อมพงษ์", "ทองหล่อ", "เอกมัย", "พระโขนง", "อ่อนนุช", "บางจาก", "ปุณณวิถี", "อุดมสุข", "บางนา", "แบริ่ง", "สำโรง", "ปู่เจ้า", "ช้างเอราวัณ", "โรงเรียนนายเรือ", "ปากน้ำ", "ศรีนครินทร์", "แพรกษา", "สายลวด", "เคหะฯ"],
    "สายสีลม (สีเขียวเข้ม)": ["สนามกีฬาแห่งชาติ", "สยาม", "ราชดำริ", "ศาลาแดง", "ช่องนนทรี", "เซนต์หลุยส์", "สุรศักดิ์", "สะพานตากสิน", "กรุงธนบุรี", "วงเวียนใหญ่", "โพธิ์นิมิตร", "ตลาดพลู", "วุฒากาศ", "บางหว้า"],
    "สายสีทอง": ["กรุงธนบุรี", "เจริญนคร", "คลองสาน"]
  },
  "MRT": {
    "สายเฉลิมรัชมงคล (สีน้ำเงิน)": ["ท่าพระ", "จรัญฯ 13", "ไฟฉาย", "บางขุนนนท์", "บางยี่ขัน", "สิรินธร", "บางพลัด", "บางอ้อ", "บางโพ", "เตาปูน", "บางซื่อ", "กำแพงเพชร", "สวนจตุจักร", "พหลโยธิน", "ลาดพร้าว", "รัชดาภิเษก", "สุทธิสาร", "ห้วยขวาง", "ศูนย์วัฒนธรรมแห่งประเทศไทย", "พระราม 9", "เพชรบุรี", "สุขุมวิท", "ศูนย์การประชุมแห่งชาติสิริกิติ์", "คลองเตย", "ลุมพินี", "สีลม", "สามย่าน", "หัวลำโพง", "วัดมังกร", "สามยอด", "สนามไชย", "อิสรภาพ", "บางไผ่", "บางหว้า", "เพชรเกษม 48", "ภาษีเจริญ", "บางแค", "หลักสอง"],
    "สายฉลองรัชธรรม (สีม่วง)": ["คลองบางไผ่", "ตลาดบางใหญ่", "สามแยกบางใหญ่", "บางพลู", "บางรักใหญ่", "บางรักน้อยท่าอิฐ", "ไทรม้า", "สะพานพระนั่งเกล้า", "แยกนนทบุรี 1", "บางกระสอ", "ศูนย์ราชการนนทบุรี", "กระทรวงสาธารณสุข", "แยกติวานนท์", "วงศ์สว่าง", "บางซ่อน", "เตาปูน"],
    "สายสีเหลือง": ["ลาดพร้าว", "ภาวนา", "โชคชัย 4", "ลาดพร้าว 71", "ลาดพร้าว 83", "มหาดไทย", "ลาดพร้าว 101", "บางกะปิ", "แยกลำสาลี", "ศรีกรีฑา", "หัวหมาก", "กลันตัน", "ศรีนุช", "ศรีนครินทร์ 38", "สวนหลวง ร.9", "ศรีอุดม", "ศรีเอี่ยม", "ศรีลาซาล", "ศรีแบริ่ง", "ศรีด่าน", "ศรีเทพา", "ทิพวัล", "สำโรง"],
    "สายสีชมพู": ["ศูนย์ราชการนนทบุรี", "แคราย", "สนามบินน้ำ", "สามัคคี", "กรมชลประทาน", "แยกปากเกร็ด", "เลี่ยงเมืองปากเกร็ด", "แจ้งวัฒนะ-ปากเกร็ด 28", "ศรีรัช", "เมืองทองธานี", "แจ้งวัฒนะ 14", "ศูนย์ราชการเฉลิมพระเกียรติ", "โทรคมนาคมแห่งชาติ", "หลักสี่", "ราชภัฏพระนคร", "วัดพระศรีมหาธาตุ", "รามอินทรา 3", "ลาดปลาเค้า", "รามอินทรา กม.4", "มัยลาภ", "วัชรพล", "รามอินทรา กม.6", "คู้บอน", "รามอินทรา กม.9", "วงแหวนรามอินทรา", "นพรัตน์", "บางชัน", "เศรษฐบุตรบำเพ็ญ", "ตลาดมีนบุรี", "มีนบุรี"]
  },
  "ARL": {
    "Airport Rail Link": ["พญาไท", "ราชปรารภ", "มักกะสัน", "รามคำแหง", "หัวหมาก", "บ้านทับช้าง", "ลาดกระบัง", "สุวรรณภูมิ"]
  },
  "SRT": {
    "สายสีแดงเข้ม (ธานีรัถยา)": ["กรุงเทพอภิวัฒน์", "จตุจักร", "วัดเสมียนนารี", "บางเขน", "ทุ่งสองห้อง", "หลักสี่", "การเคหะ", "ดอนเมือง", "หลักหก", "รังสิต"],
    "สายสีแดงอ่อน (นครวิถี)": ["กรุงเทพอภิวัฒน์", "บางซ่อน", "บางบำหรุ", "ตลิ่งชัน"]
  }
};
